spec/sem4r/ad_group_ad/fixtures/mutate_add_mobile_ad-req.xml

<?xml version='1.0' encoding='UTF-8'?>
<env:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
              xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'
              xmlns='https://adwords.google.com/api/adwords/cm/v200909'
              xmlns:s='https://adwords.google.com/api/adwords/cm/v200909'>

  <env:Header>
    <s:RequestHeader env:mustUnderstand='0'>
      <authToken>
        ***censured***
      </authToken>
      <userAgent>
        Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
      </userAgent>
      <developerToken>
        ***censured***
      </developerToken>
      <clientEmail>
        ***censured***
      </clientEmail>
    </s:RequestHeader>
  </env:Header>

  <env:Body>
    <mutate xmlns='https://adwords.google.com/api/adwords/cm/v200909'>
      <operations xsi:type='AdGroupAdOperation'>
        <operator>
          ADD
        </operator>

        <operand xsi:type='AdGroupAd'>
          <adGroupId>3060217927</adGroupId>
          <ad xsi:type='MobileAd'>
            <headline>sem4r</headline>
            <description>simply adwords</description>
            <mobileCarriers>Vodafone@IT</mobileCarriers>
            <businessName>sem4r</businessName>
            <countryCode>IT</countryCode>
            <phoneNumber>0612345</phoneNumber>
          </ad>
          <status>ENABLED</status>
        </operand>

      </operations>
    </mutate>
  </env:Body>
</env:Envelope>
